# ============================================================
#  Brewfile — Generated 2026-03-19
#  Usage: brew bundle --file=~/Brewfile
# ============================================================

# ----- Taps -----
tap "bufbuild/buf"

# ----- Formulas (CLI tools) -----
brew "age"
brew "awscli"
brew "bufbuild/buf/buf"
brew "cloudflared"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "lazygit"
brew "mas"
brew "mise"
brew "uv"
brew "neovim"
brew "ripgrep"
brew "sops"
brew "starship"
brew "tmux"
brew "tree"
brew "z"

# ----- Casks (GUI Applications) -----
cask "1password"                    # 1Password
cask "1password-cli"                # 1Password CLI
cask "adobe-creative-cloud"         # Adobe Creative Cloud
cask "claude"                       # Claude
cask "docker"                       # Docker Desktop
cask "font-hack-nerd-font"          # Hack Nerd Font
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono Nerd Font
cask "ghostty"                      # Ghostty
cask "google-chrome"                # Google Chrome
cask "google-cloud-sdk"             # Google Cloud SDK
cask "google-drive"                 # Google Drive
cask "google-japanese-ime"          # Google日本語入力
cask "jetbrains-toolbox"            # JetBrains Toolbox
cask "karabiner-elements"           # Karabiner-Elements
cask "notion"                       # Notion
cask "raycast"                      # Raycast
cask "slack"                        # Slack
cask "visual-studio-code"           # Visual Studio Code
cask "zoom"                         # Zoom

# ----- Mac App Store (via mas) -----
mas "Keynote", id: 409183694
mas "LadioCast", id: 411213048
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
