# ============================================================
#  Brewfile — Generated 2026-03-19
#  Usage: brew bundle --file=~/Brewfile
# ============================================================

# ----- Taps -----
tap "bufbuild/buf"
tap "homebrew/bundle"

# ----- Formulas (CLI tools) -----
brew "age"
brew "awscli"
brew "bufbuild/buf/buf"
brew "cloudflared"
brew "colima"
brew "docker"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "go"
brew "grpcurl"
brew "lazygit"
brew "libyaml"
brew "mas"                          # Mac App Store CLI (for Keynote, Numbers, Pages etc.)
brew "mise"
brew "mp3splt"
brew "neovim"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "poetry"
brew "poppler"
brew "ripgrep"
brew "sops"
brew "starship"
brew "tmux"
brew "tree"
brew "xcodegen"
brew "z"
brew "zbar"

# ----- Casks (GUI Applications) -----
cask "1password"                    # 1Password
cask "1password-cli"                # 1Password CLI (already installed)
cask "adobe-acrobat-reader"         # Adobe Acrobat DC
cask "adobe-creative-cloud"         # Adobe Creative Cloud (Illustrator, Photoshop含む)
cask "bartender"                    # Bartender 6
cask "blackhole-16ch"               # BlackHole 16ch (already installed)
cask "blackhole-2ch"                # BlackHole 2ch (already installed)
cask "blackhole-64ch"               # BlackHole 64ch (already installed)
cask "claude"                       # Claude
cask "cloudflare-warp"              # Cloudflare WARP
cask "cursor"                       # Cursor
cask "docker"                       # Docker Desktop
cask "drawio"                       # draw.io
cask "font-hack-nerd-font"          # Hack Nerd Font (already installed)
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono Nerd Font (already installed)
cask "ghostty"                      # Ghostty (already installed)
cask "google-chrome"                # Google Chrome
cask "google-drive"                 # Google Drive
cask "google-japanese-ime"          # Google日本語入力
cask "jetbrains-toolbox"            # JetBrains Toolbox
cask "karabiner-elements"           # Karabiner-Elements
cask "libreoffice"                  # LibreOffice
cask "notion"                       # Notion
cask "obs"                          # OBS Studio
cask "postman"                      # Postman
cask "raycast"                      # Raycast
cask "slack"                        # Slack
cask "tabby"                        # Tabby
cask "termius"                      # Termius
cask "unity-hub"                    # Unity Hub
cask "visual-studio-code"           # Visual Studio Code
cask "zoom"                         # Zoom

# ----- Mac App Store (via mas) -----
mas "GCal for Google Calendar", id: 1107163858
mas "Keynote", id: 409183694
mas "LadioCast", id: 411213048
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835

# ----- Not available via Homebrew -----
# DeNASecurityAgent.app    — 社内セキュリティツール（MDM配布）
# Falcon.app               — CrowdStrike Falcon（MDM配布）
# Rakuro.app               — cask未提供
# Self Service+.app        — MDM配布
# Google Docs/Sheets/Slides — PWA（Chrome経由）
